#include "driver_i2c.h"
#include "bh1750.h"

/******************************************************************
 * 函 数 名 称：Single_Write
 * 函 数 说 明：向BH1750写入命令
 * 函 数 形 参：REG_Address=写入的命令
 * 函 数 返 回：0写入成功  1=器件地址错误（识别不到模块） 2=命令错误
 * 作       者：LC
 * 备       注：无
******************************************************************/
char bh1750_Write(uint8_t REG_Address)
{
      I2C_Start();                        //起始信号
      I2C_WriteByte(SlaveAddress);            //发送设备地址+写信号
      
      I2C_WriteByte(REG_Address);             //内部寄存器地址

      I2C_Stop();                         //发送停止信号
      return 0;
}

/******************************************************************
 * 函 数 名 称：bh1750_Read
 * 函 数 说 明：读取BH1750内部数据
 * 函 数 形 参：无
 * 函 数 返 回：光照度 单位:lx
 * 作       者：LC
 * 备       注：无
******************************************************************/
float bh1750_Read(void)
{
   uint16_t dis_data=0;
   uint8_t dat_buff[2];

   I2C_Start();                            //起始信号
   I2C_WriteByte(SlaveAddress+1);              //发送设备地址+读信号
   

   dat_buff[0] = I2C_ReadByte(0);              //读取高8位
   dat_buff[1] = I2C_ReadByte(1);              //读取低8位
   I2C_Stop();                             //停止信号

   //合成数据，即光照数据
   dis_data=( dat_buff[0] << 8 ) + dat_buff[1];
   return ((float)dis_data/1.2f);
}

/******************************************************************
 * 函 数 名 称：bh1750_Init
 * 函 数 说 明：初始化BH1750
 * 函 数 形 参：无
 * 函 数 返 回：无
 * 作       者：LC
 * 备       注：无
******************************************************************/
void bh1750_Init(void)
{
   bh1750_Write(0x01);//上电
}
